#pragma once
//==============================================================================================================================================
//
// ブロックマネージャーに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _BLOCKMANAGER_H_ //このマクロ定義がされなかったら
#define _BLOCKMANAGER_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "objectmanager.h"//オブジェクトマネージャー
#include "block.h"//ブロックヘッダー

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CBlockManager : public CObjectManager
{
public:
	//======================================
	// 関数
	//======================================
	CBlockManager(int nPriority = 97);//コンストラクタ
	~CBlockManager() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	void Collision(D3DXVECTOR3& pos, D3DXVECTOR3& oldpos, D3DXVECTOR3& size);//当たり判定
	bool Reflection(D3DXVECTOR3& pos, D3DXVECTOR3& oldpos, D3DXVECTOR3& move, D3DXVECTOR3& rot, D3DXVECTOR3& size);//反射処理
	CBlock* GetTop() { return m_pTop; }//先頭オブジェクトの情報を取得

private:
	//======================================
	// 変数
	//======================================
	CBlock* m_pTop;//先頭オブジェクトのポインタ
	CBlock* m_pCur;//終端オブジェクトのポインタ
};

#endif
