#pragma once
//==============================================================================================================================================
//
// ブルースライムの処理に関するヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _BLUESLIME_H_
#define _BLUESLIME_H_

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "slime.h"//スライムヘッダー

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CBlueSlime : public CSlime
{
public:
	//======================================
	// 関数
	//======================================
	CBlueSlime(int nPriority = 3);//コンストラクタ
	~CBlueSlime() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	bool Collision(D3DXVECTOR3 pos, D3DXVECTOR3 size) override;//当たり判定
	void Hit() override;//ヒット処理
};

#endif