//==============================================================================================================================================
//
// 無敵バレット(反射)の処理
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "boundinvincible.h"//無敵バレット(反射)
#include "player.h"//プレイヤー

//===========================================================================================================
// コンストラクタ
//===========================================================================================================
CBoundInvincible::CBoundInvincible(int nPriority) : CBoundEnemyBullet(nPriority)
{
}

//===========================================================================================================
// デストラクタ
//===========================================================================================================
CBoundInvincible::~CBoundInvincible()
{
}

//===========================================================================================================
// 初期化処理
//===========================================================================================================
HRESULT CBoundInvincible::Init()
{
	//エネミーバレット(反射)初期化処理
	if (FAILED(CBoundEnemyBullet::Init()))
	{
		return E_FAIL;
	}

	return S_OK;
}

//===========================================================================================================
// 終了処理
//===========================================================================================================
void CBoundInvincible::Uninit()
{
	//エネミーバレット(反射)終了処理
	CBoundEnemyBullet::Uninit();
}

//===========================================================================================================
// 更新処理
//===========================================================================================================
void CBoundInvincible::Update()
{
	//指定した順番にオブジェクト情報を取得
	for (int nCnt = 0; nCnt < MAX_PRIORITY; nCnt++)
	{
		//先頭
		CObject* pObj = CObject::GetTop(nCnt);

		//オブジェクト情報がnullptrになるまで繰り返す
		while (pObj != nullptr)
		{
			//次のオブジェクト情報を取得
			CObject* pNext = pObj->GetNext();

			//オブジェクトタイプの取得
			CObject::TYPE type = pObj->GetType();

			//タイプがプレイヤーの場合
			if (type == CObject::TYPE::PLAYER)
			{
				//オブジェクト情報をプレイヤー情報に変換
				CPlayer* pPlayer = (CPlayer*)pObj;

				//情報を取得
				D3DXVECTOR3 Pos = GetPos();//位置

				//プレイヤーとの当たり判定が有効の場合
				if (pPlayer->Collision(Pos))
				{
					//プレイヤーをダメージ状態に設定
					pPlayer->SetPlayerState(CPlayer::DAMAGE, 20);

					//終了処理
					Uninit();
				}
			}

			//オブジェクト情報を次の情報に変更する
			pObj = pNext;
		}
	}

	//エネミーバレット(反射)更新処理
	CBoundEnemyBullet::Update();
}

//===========================================================================================================
// 描画処理
//===========================================================================================================
void CBoundInvincible::Draw()
{
	//エネミーバレット(反射)描画処理
	CBoundEnemyBullet::Draw();
}
