#pragma once
//==============================================================================================================================================
//
// エネミーバレット(反射)に関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _BOUNDENEMYBULLET_H_
#define _BOUNDENEMYBULLET_H_

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "bullet.h"//バレットヘッダー

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CBoundEnemyBullet : public CBullet
{
public:
	//======================================
	// 関数
	//======================================
	CBoundEnemyBullet(int nPriority = 3);//コンストラクタ
	~CBoundEnemyBullet() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	bool Collision(D3DXVECTOR3 pos) override;//当たり判定

private:
	const float REFLECT_RANGE = 20.0f;//反射可能距離
};

#endif
