//==============================================================================================================================================
//
// フィールドに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _FIELD_H_ //このマクロ定義がされなかったら
#define _FIELD_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "object3D.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CField : public CObject3D
{
public:
	//======================================
	// 関数
	//======================================
	CField(int nPriority = 3);//コンストラクタ
	~CField() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CField* Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);//生成処理
	void Release() override;//削除処理

	//======================================
	// 変数
	//======================================
	static constexpr float FIELD_WIDTH = 4400.0f;//横幅
	static constexpr float FIELD_HEIGHT = 650.0f;//縦幅
};

#endif
