#pragma once
//==============================================================================================================================================
//
// GameStartUIに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _GAMESTART_H_ //このマクロ定義がされなかったら
#define _GAMESTART_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "object2D.h"//2Dオブジェクト

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CGameStart : public CObject2D
{
public:
	//======================================
	// 関数
	//======================================
	CGameStart(int nPriority = 4);//コンストラクタ
	~CGameStart() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CGameStart* Create();//生成処理

private:
	//======================================
	// 変数
	//======================================
	static constexpr const char* TEXTURE_FILE = "data/TEXTURE/Tutorial/GameStart000.png";//テクスチャファイル
	const D3DXVECTOR2 POS = { 1150.0f, 40.0f };//位置
	const D3DXVECTOR2 SIZE = { 280.0f, 50.0f };//サイズ
	const float STAND_SPEED = 0.02f;//待機中の点滅速度
	bool m_bLightUp;//ライトアップフラグ
};

#endif
