#pragma once
//==============================================================================================================================================
//
// ギミックマネージャーに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _GIMMICKMANAGER_H_ //このマクロ定義がされなかったら
#define _GIMMICKMANAGER_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "objectmanager.h"//オブジェクトマネージャー
#include "gimmick.h"//ギミック

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CGimmickManager : public CObjectManager
{
public:
	//======================================
	// 関数
	//======================================
	CGimmickManager(int nPriority = 97);//コンストラクタ
	~CGimmickManager() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	void Collision(D3DXVECTOR3& pos, D3DXVECTOR3& move, D3DXVECTOR3 size, D3DXVECTOR3& rot);//当たり判定
	CGimmick* GetTop() { return m_pTop; }//先頭オブジェクト情報を取得

private:
	//======================================
	// 変数
	//======================================
	CGimmick* m_pTop;//先頭オブジェクトのポインタ
	CGimmick* m_pCur;//終端オブジェクトのポインタ
};

#endif
