#pragma once
//==============================================================================================================================================
//
// アイテムマネージャーに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _ITEMMANAGER_H_ //このマクロ定義がされなかったら
#define _ITEMMANAGER_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "objectmanager.h"//オブジェクトマネージャー
#include "item.h"//アイテム

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CItemManager : public CObjectManager
{
public:
	//======================================
	// 関数
	//======================================
	CItemManager(int nPriority = 97);//コンストラクタ
	~CItemManager() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	void Collision(D3DXVECTOR3& pos, D3DXVECTOR3 size, int& nLife);//当たり判定

private:
	//======================================
	// 変数
	//======================================
	CItem* m_pTop;//先頭オブジェクトのポインタ
	CItem* m_pCur;//終端オブジェクトのポインタ
};

#endif
