#pragma once
//==============================================================================================================================================
//
// エネミーバレット(打ち上げ)に関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _LAUNCHENEMYBULLET_H_
#define _LAUNCHENEMYBULLET_H_

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "bullet.h"//バレットヘッダー

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CLaunchEnemyBullet : public CBullet
{
public:
	//======================================
	// 関数
	//======================================
	CLaunchEnemyBullet(int nPriority = 3);//コンストラクタ
	~CLaunchEnemyBullet() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	bool Collision(D3DXVECTOR3 pos) override;//当たり判定

private:
	//======================================
	// 変数
	//======================================
	static constexpr float MAX_GRAVITY = 0.3f;//弾の重力の強さ
	const float REFLECT_RANGE = 40.0f;//反射可能距離
};

#endif
