#pragma once
//===========================================================================================================================================================================================
//
// マウス処理に関するヘッダーファイル
// Author;久保市篤武
//
//===========================================================================================================================================================================================
#ifndef _MOUSE_H_  //このマクロ定義がされなかったら
#define _MOUSE_H_  //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "input.h"//インプット

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CInputMouse : public CInput
{
public:
	//======================================
	// 列挙型定義
	//======================================

	//クリックの種類
	typedef enum
	{
		MOUSE_LEFT = 0,//左クリック
		MOUSE_RIGHT,//右クリック
		MOUSE_MAX
	}MOUSE;

	//======================================
	// 関数
	//======================================
	CInputMouse();//コンストラクタ
	~CInputMouse();//デストラクタ
	HRESULT Init(HINSTANCE hInstance, HWND hWnd);//初期化処理
	void Uninit(void);//終了処理
	void Update(void);//更新処理
	bool GetPress(int nKey);//プレス情報
	bool GetTrigger(int nKey);//トリガー情報
	bool GetRepeat(int nKey);//リピート情報
	DIMOUSESTATE Get() {return m_MouseStatePress;};//マウス情報の取得

private:
	//======================================
	// 変数
	//======================================
	const int SPEED_REPEAT = 5;//リピート間隔
	static int m_nCntKey;//長押し時間計測
	DIMOUSESTATE m_MouseStatePress;//マウスのプレス入力情報
	DIMOUSESTATE m_MouseStateTrigger;//マウスのトリガー入力情報
	DIMOUSESTATE m_MouseStateRepeat;//マウスのリピート入力情報
};

#endif

