#pragma once
//==============================================================================================================================================
//
// 操作方法UIに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _OPERATION_H_ //このマクロ定義がされなかったら
#define _OPERATION_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "object2D.h"//2Dオブジェクト

//===========================================================================================================
// クラス定義
//===========================================================================================================
class COperation : public CObject2D
{
public:
	//======================================
	// 関数
	//======================================
	COperation(int nPriority = 4);//コンストラクタ
	~COperation() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static COperation* Create();//生成処理

private:
	//======================================
	// 変数
	//======================================
	static constexpr const char* TEXTURE_FILE = "data/TEXTURE/Tutorial/Operation000.png";//テクスチャファイル
	const D3DXVECTOR2 POS = { 980.0f, 580.0f };//位置
	const D3DXVECTOR2 SIZE = { 560.0f, 260.0f };//サイズ
};

#endif
