//==============================================================================================================================================
//
// ポイントマネージャーに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _POINTMANAGER_H_ //このマクロ定義がされなかったら
#define _POINTMANAGER_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "objectmanager.h"//オブジェクトマネージャー
#include "point.h"//ポイント

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CPointManager : public CObjectManager
{
public:
	//======================================
	// 関数
	//======================================
	CPointManager();//コンストラクタ
	~CPointManager() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	CPoint* GetTop() { return m_pTop; }//先頭オブジェクト

private:
	//======================================
	// 変数
	//======================================
	CPoint* m_pTop;//先頭オブジェクトのポインタ
	CPoint* m_pCur;//終端オブジェクトのポインタ
};

#endif
