#pragma once
//==============================================================================================================================================
//
// リザルトの見出しUIに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _RESULTHEADING_H_ //このマクロ定義がされなかったら
#define _RESULTHEADING_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "object2D.h"//2Dオブジェクト

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CResultHeading : public CObject2D
{
public:
	//======================================
	// 関数
	//======================================
	CResultHeading(int nPriority = 4);//コンストラクタ
	~CResultHeading() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CResultHeading* Create();//生成処理

private:
	//======================================
	// 変数
	//======================================
	static constexpr const char* TEXTURE_FILE = "data/TEXTURE/Result/Heading000.png";//テクスチャファイル
	const D3DXVECTOR2 POS = { CProcess::SCREEN_WIDTH * 0.5f, 90.0f };//位置
	const D3DXVECTOR2 SIZE = { 480.0f, 150.0f };//サイズ
};

#endif
