#pragma once
//==============================================================================================================================================
//
// リザルトの見出しUIに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _SCOREUI_H_ //このマクロ定義がされなかったら
#define _SCOREUI_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "object2D.h"//2Dオブジェクト

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CScoreUI : public CObject2D
{
public:
	//======================================
	// 関数
	//======================================
	CScoreUI(int nPriority = 4);//コンストラクタ
	~CScoreUI() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CScoreUI* Create();//生成処理

private:
	//======================================
	// 変数
	//======================================
	static constexpr const char* TEXTURE_FILE = "data/TEXTURE/Result/ScoreUI000.png";//テクスチャファイル
	const D3DXVECTOR2 POS = { 230.0f, 400.0f };//位置
	const D3DXVECTOR2 SIZE = { 400.0f, 200.0f };//サイズ
	const float COLOR_ASCENT = 0.02f;//カラー上昇速度
};

#endif
