#pragma once
//==============================================================================================================================================
//
// 衝撃波に関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _SHOCKWAVE_H_ //このマクロ定義がされなかったら
#define _SHOCKWAVE_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "effect3D.h"//3Dエフェクト

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CShockWave : public CEffect3D
{
public:
	//======================================
	// 関数
	//======================================
	CShockWave(int nPriority);//コンストラクタ
	~CShockWave() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理

private:
	//======================================
	// 関数
	//======================================
	void Scaling();//拡大処理
	void FlucColor();//カラー変動処理

	//======================================
	// 変更
	//======================================
	const float SCALE_SPEED = 1.5f;//拡大速度
	const float FLUC_COLOR = 0.1f;//カラー変動速度
	bool m_bFlucUP;//カラーα値上昇フラグ
};

#endif