//==============================================================================================================================================
//
// スコア表示に関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "stagenumber.h"//現在のステージ数表示
#include "timer.h"//タイマーデータ
#include "game.h"//ゲームシーン

//===========================================================================================================
// 静的メンバ変数初期化
//===========================================================================================================
CStageNumber* CStageNumber::m_apNumber[MAX_NUMBER] = {};//オブジェクト情報

//===========================================================================================================
// コンストラクタ
//===========================================================================================================
CStageNumber::CStageNumber(int nPriority) : CObject2D(nPriority)
{
	//メンバ変数初期化
	m_nIdx = 0;//各桁のID
}

//===========================================================================================================
// デストラクタ
//===========================================================================================================
CStageNumber::~CStageNumber()
{
}

//===========================================================================================================
// 初期化処理
//===========================================================================================================
HRESULT CStageNumber::Init()
{
	//パラメータ設定
	SetSize(SIZE);//サイズ
	SetPos(POS);//位置

	//テクスチャ生成
	CTexture* pTex = CManager::GetTexture();//取得
	int nTextureIdx = pTex->Regist(TEXTURE_FILE);//登録
	BindTexture(pTex->GetAddress(nTextureIdx));//設定
	SetTextureIdx(nTextureIdx);//ID設定

	//2Dオブジェクト初期化処理
	if (FAILED(CObject2D::Init()))
	{
		return E_FAIL;
	}

	return S_OK;
}

//===========================================================================================================
// 終了処理
//===========================================================================================================
void CStageNumber::Uninit()
{
	//2Dオブジェクト終了処理
	CObject2D::Uninit();
}

//===========================================================================================================
// 解放処理
//===========================================================================================================
void CStageNumber::Release()
{
	//2Dオブジェクト解放処理
	CObject2D::Release();

	//IDを保存
	int nID = m_nIdx;

	//データが存在する場合
	if (m_apNumber[nID] != nullptr)
	{
		m_apNumber[nID] = nullptr;
	}
}

//===========================================================================================================
// 更新処理
//===========================================================================================================
void CStageNumber::Update()
{
	//ローカル変数宣言
	VERTEX_2D* pVtx;//頂点情報へのポインタ
	LPDIRECT3DVERTEXBUFFER9 pVtxBuff = GetVtxBuff();//頂点バッファへのポインタ
	D3DXCOLOR col = GetColor();//カラー
	int aPosTexU[MAX_NUMBER];//各桁の数字を格納用
	int nMulti = 10;//各桁の倍数

	//各桁の数字を求める
	for (int nCnt = 0; nCnt < m_nIdx; nCnt++)
	{
		//何桁目かを求める
		nMulti *= 10;
	}

	//数字に合わせてテクスチャ座標を変更
	aPosTexU[m_nIdx] = ((int)CGame::GetNumStage() + 1 % nMulti) / (nMulti / 10);

	//頂点バッファをロックし、頂点情報へのポインタを取得
	pVtxBuff->Lock(0, 0, (void**)&pVtx, 0);

	//テクスチャ座標の更新
	pVtx[0].tex = D3DXVECTOR2(aPosTexU[m_nIdx] / 10.0f, 0.0f);
	pVtx[1].tex = D3DXVECTOR2((aPosTexU[m_nIdx] + 1) / 10.0f, 0.0f);
	pVtx[2].tex = D3DXVECTOR2(aPosTexU[m_nIdx] / 10.0f, 1.0f);
	pVtx[3].tex = D3DXVECTOR2((aPosTexU[m_nIdx] + 1) / 10.0f, 1.0f);

	//頂点バッファをアンロックする
	pVtxBuff->Unlock();

	//2Dオブジェクト更新処理
	CObject2D::Update();
}

//===========================================================================================================
// 描画処理
//===========================================================================================================
void CStageNumber::Draw()
{
	//2Dオブジェクト描画処理
	CObject2D::Draw();
}

//===========================================================================================================
// 生成処理
//===========================================================================================================
CStageNumber* CStageNumber::Create(int nIdx)
{
	//データが存在しない場合
	if (m_apNumber[nIdx] == nullptr)
	{
		//メモリを動的確保
		m_apNumber[nIdx] = NEW CStageNumber();

		//パラメータ設定
		m_apNumber[nIdx]->SetType(TYPE::UI);//オブジェクトタイプ
		m_apNumber[nIdx]->SetIndex(nIdx);//番号

		//初期化処理
		m_apNumber[nIdx]->Init();
	}

	return m_apNumber[nIdx];
}

//===========================================================================================================
// 生成位置設定
//===========================================================================================================
void CStageNumber::SetPos(D3DXVECTOR2 pos)
{
	//ローカル変数宣言
	D3DXVECTOR2 size = GetSize();//サイズ情報

	//右から順番に生成していく
	CObject2D::SetPos({ pos.x - size.x * m_nIdx, pos.y });
}
