#pragma once
//==============================================================================================================================================
//
// タイマー表示に関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _TIMENUMBER_H_
#define _TIMENUMBER_H_

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "object2D.h"//2Dオブジェクト

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CStageNumber : public CObject2D
{
public:
	//======================================
	// 関数
	//======================================
	CStageNumber(int nPriority = 97);//コンストラクタ
	~CStageNumber() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CStageNumber* Create(int nIdx);//生成処理

	//======================================
	// 変数
	//======================================
	static const int MAX_NUMBER = 2;//桁数

private:
	//======================================
	// 関数
	//======================================

	//パラメータ設定
	void SetIndex(int nIdx) { m_nIdx = nIdx; }//ID
	void SetPos(D3DXVECTOR2 pos);//位置

	//======================================
	// 変数
	//======================================
	static constexpr const char* TEXTURE_FILE = "data/TEXTURE/number000.png";//テクスチャファイル
	const D3DXVECTOR2 SIZE = { 40.0f, 80.0f };//サイズ
	const D3DXVECTOR2 POS = { 330.0f, 50.0f };//位置
	static CStageNumber* m_apNumber[MAX_NUMBER];//各桁の情報
	int m_nIdx;//番号
};

#endif
