//==============================================================================================================================================
//
// テクスチャに関する管理
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "texture.h"
#include "manager.h"
#include "renderer.h"

//===========================================================================================================
// コンストラクタ
//===========================================================================================================
CTexture::CTexture()
{
	//メンバ変数初期化
	for (int nCnt = 0; nCnt < MAX_TEXTURE; nCnt++)
	{
		m_pTexture[nCnt] = nullptr;//テクスチャ配列
		m_TextureName[nCnt] = nullptr;//作成済みテクスチャ保管配列
	}

	m_nAllTexture = 0;//テクスチャ総数
}

//===========================================================================================================
// デストラクタ
//===========================================================================================================
CTexture::~CTexture()
{
}

//===========================================================================================================
// テクスチャ破棄
//===========================================================================================================
void CTexture::Unload()
{
	//メンバ変数初期化
	for (int nCnt = 0; nCnt < MAX_TEXTURE; nCnt++)
	{
		if (m_pTexture[nCnt] != nullptr)
		{
			m_pTexture[nCnt]->Release();
			m_pTexture[nCnt] = nullptr;//テクスチャ配列
			m_TextureName[nCnt] = nullptr;//作成済みテクスチャ保管配列
		}
	}
}

//===========================================================================================================
// テクスチャ登録
//===========================================================================================================
int CTexture::Regist(const char* pTextureName)
{
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();//デバイスの取得
	int nIdx = 0;//テクスチャID
	
	for (int nCnt = 0; nCnt < MAX_TEXTURE; nCnt++)
	{
		nIdx = nCnt;//ID設定

		//テクスチャ情報が存在しない場合
		if (m_TextureName[nCnt] == nullptr)
		{
			m_TextureName[nCnt] = pTextureName;//テクスチャ情報保管
			D3DXCreateTextureFromFile(pDevice, m_TextureName[nCnt], &m_pTexture[nCnt]);//テクスチャ読込
			m_nAllTexture++;//テクスチャ総数加算
			break;
		}
		
		//テクスチャ情報が存在する場合
		else if (strcmp(pTextureName, m_TextureName[nCnt]) == 0)
		{
			break;
		}
	}

	return nIdx;//IDを返す
}
