#pragma once
//==============================================================================================================================================
//
// タイトルフレームに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _TITLEFRAME_H_ //このマクロ定義がされなかったら
#define _TITLEFRAME_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "object2D.h"//2Dオブジェクト

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CTitleFrame : public CObject2D
{
public:
	//======================================
	// 関数
	//======================================
	CTitleFrame();//コンストラクタ
	~CTitleFrame() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CTitleFrame* Create(D3DXVECTOR2 pos);//生成処理

	//======================================
	// 変数
	//======================================
	static const int MAX_NUM_WIDTH = 16;//横の数
	static const int MAX_NUM_HEIGHT = 9;//縦の数
	static inline const D3DXVECTOR2 FRAME_SIZE = { 80.0f, 80.0f };//サイズ

private:
	//======================================
	// 列挙型定義
	//======================================

	//カラーパターン
	typedef enum
	{
		COLOR_RED,//赤
		COLOR_BLUE,//青
		COLOR_YELLOW,//黄
		COLOR_GREEN,//緑
		COLOR_MAX
	}COLOR_PATTERN;

	//======================================
	// 変数
	//======================================
	static constexpr const char* TEXTURE_FILE = "data/TEXTURE/Title/TitleFrame000.png";//テクスチャファイル
	static inline const D3DXCOLOR COLOR[COLOR_MAX] =
	{
		{1.0f,0.5f,0.5f,1.0f},
		{0.0f,0.5f,1.0f,1.0f},
		{1.0f,1.0f,0.5f,1.0f},
		{0.0f,0.5f,0.0f,1.0f},
	};//カラーパターン
};

#endif
