#pragma once
//==============================================================================================================================================
//
// タイトル画面に関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _TITLE_H_ //このマクロ定義がされなかったら
#define _TITLE_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "manager.h"//マネージャー

//===========================================================================================================
// 前方宣言
//===========================================================================================================
class CBlockManager;//ブロックマネージャー
class CBulletManager;//バレットマネージャー

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CTitle : public CScene
{
public:
	//======================================
	// 関数
	//======================================
	CTitle();//コンストラクタ
	~CTitle() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CTitle* Create();//生成処理
	static CBlockManager* GetBlockManager() { return m_pBlockManager; }//ブロックマネージャー情報
	static CBulletManager* GetBulletManager() { return m_pBulletManager; }//バレットマネージャー情報

private:
	//======================================
	// 変数
	//======================================
	static constexpr int NUM_CREATE_BULLET = 12;//バレット生成数
	static CBlockManager* m_pBlockManager;//ブロックマネージャー情報
	static CBulletManager* m_pBulletManager;//バレットマネージャー情報
};

#endif
