#pragma once
//==============================================================================================================================================
//
// 2Dの軌跡に関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _TRAJECTORY2D_H_ //このマクロ定義がされなかったら
#define _TRAJECTORY2D_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "object2D.h"//2Dオブジェクト

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CTrajectory2D : public CObject2D
{
public:
	//======================================
	// 関数
	//======================================
	CTrajectory2D(int nPriority = 1);//コンストラクタ
	~CTrajectory2D() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CTrajectory2D* Create(D3DXVECTOR2 pos, D3DXVECTOR2 size, D3DXCOLOR col, const char* TextureFile);//生成処理

private:
	//======================================
	// 関数
	//======================================

	//情報設定
	void SetTextureFile(const char* TextureFile) { m_TextureFile = TextureFile; }//テクスチャファイル

	//======================================
	// 変数
	//======================================
	static const int MAX_LIFE = 8;//最大ライフ
	const char* m_TextureFile;//テクスチャファイル
	int m_nLife;//ライフ
};

#endif
