#pragma once
//==============================================================================================================================================
//
// ホワイトゴーストの処理に関するヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _WHITEGHOST_H_
#define _WHITEGHOST_H_

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "ghost.h"//ゴーストヘッダー

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CWhiteGhost : public CGhost
{
public:
	//======================================
	// 関数
	//======================================
	CWhiteGhost(int nPriority = 3);//コンストラクタ
	~CWhiteGhost() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	bool Collision(D3DXVECTOR3 pos, D3DXVECTOR3 size) override;//当たり判定
	void Hit() override;//ヒット処理
};

#endif
