//==============================================================================================================================================
//
// エリアマネージャーに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _AREAMANAGER_H_ //このマクロ定義がされなかったら
#define _AREAMANAGER_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "objectmanager.h"
#include "area.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CAreaManager : public CObjectManager
{
public:
	//======================================
	// 関数
	//======================================
	CAreaManager();//コンストラクタ
	~CAreaManager() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	void Regist(CArea* pArea);//登録処理
	void Load() override;//読込処理
	bool Collision(const D3DXVECTOR3& pos);//当たり判定
	CArea* FindArea(CArea::TYPE type);//検索処理

private:
	//======================================
	// 変数
	//======================================
	CArea* m_pTop;//先頭オブジェクトのポインタ
	CArea* m_pCur;//終端オブジェクトのポインタ
};

#endif
