//==============================================================================================================================================
//
// ボール移動ポイントに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _BALLMOVEPOINT_H_ //このマクロ定義がされなかったら
#define _BALLMOVEPOINT_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "gimmick.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CBallMovePoint : public CGimmick
{
public:
	//======================================
	// 関数
	//======================================
	CBallMovePoint();//コンストラクタ
	~CBallMovePoint() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CBallMovePoint* Find(int nIdx);//検索処理
	int GetIdx() { return m_nIdx; }//インデックス取得
	int GetAll() { return m_nAll; }//合計数取得

private:
	//======================================
	// 変数
	//======================================
	static std::vector<CBallMovePoint*> m_BallMovePoint;//全ポイントの情報
	static int m_nAll;//合計数
	int m_nIdx;//インデックス
};

#endif

