//==============================================================================================================================================
//
// バレットエネミーに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _BULLETENEMY_H_ //このマクロ定義がされなかったら
#define _BULLETENEMY_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "enemy.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CBulletEnemy : public CEnemy
{
public:
	//======================================
	// 関数
	//======================================
	CBulletEnemy();//コンストラクタ
	~CBulletEnemy() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	bool Collision(CollisionParam& aParam) override;//当たり判定


private:
	//======================================
	// 関数
	//======================================
	void Shot(D3DXVECTOR3 Distance);//発射処理

	//======================================
	// 定数
	//======================================
	const int INTERVAL_SHOT = 2;//発射間隔(秒数)
	const float MOVABLE = 200.0f;//発射可能距離
	const float SHOT_POWER = 5.0f;//発射速度

	//======================================
	// 変数
	//======================================
	int m_nCntShot;//発射までのカウンタ
};

#endif
