//==============================================================================================================================================
//
// バレットマネージャーに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _BULLETMANAGER_H_ //このマクロ定義がされなかったら
#define _BULLETMANAGER_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "objectmanager.h"
#include "bullet.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CBulletManager : public CObjectManager
{
public:
	//======================================
	// 関数
	//======================================
	CBulletManager();//コンストラクタ
	~CBulletManager() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	void Load() override {};//読込処理
	void Regist(CBullet* pBlock);//登録処理
	
private:
	//======================================
	// 変数
	//======================================
	CBullet* m_pTop;//先頭オブジェクトのポインタ
	CBullet* m_pCur;//終端オブジェクトのポインタ
};

#endif
