#ifdef _DEBUG
//==============================================================================================================================================
//
// 2Dエディタに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _EDIT2D_H_
#define _EDIT2D_H_

class CUI;

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CEdit2D
{
public:
	//======================================
	// 関数
	//======================================
	CEdit2D();//コンストラクタ
	~CEdit2D();//デストラクタ
	HRESULT Init();//初期化処理
	void Uninit();//終了処理
	void Release();//解放処理
	void Update();//更新処理

private:
	//======================================
	// 関数
	//======================================
	void PrintInfo(CUI* pUI);//情報表示処理
	void Save();//セーブ処理
	void Move(CUI* pUI);//移動処理
	void Scale(CUI* pUI);//拡大処理
	void Turn(CUI* pUI);//回転処理
	void Reset(CUI* pUI);//リセット処理
	void Change(CUI* pUI);//カテゴリー・タイプ変更処理
	void Delete(CUI* pUI);//削除処理
	void Create(CUI* pUI);//配置

	//======================================
	// 定数
	//======================================
	const int TURN_DIRECTION = 8;//回転方向分割数
	const float MOVE = 1.0f;//移動量
	const float SCALE = 1.0f;//拡大量
	const float TURN = D3DX_PI * (1.0f / static_cast<float>(TURN_DIRECTION));//回転量

	//======================================
	// 変数
	//======================================
	int m_nTarget;//編集対象番号
	bool m_bTrigger;//移動方法がトリガーかどうか
};

#endif
#endif // _DEBUG
