//==============================================================================================================================================
//
// ギミックマネージャーに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _GIMMICKMANAGER_H_ //このマクロ定義がされなかったら
#define _GIMMICKMANAGER_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "objectmanager.h"
#include "gimmick.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CGimmickManager : public CObjectManager
{
public:
	//======================================
	// 関数
	//======================================
	CGimmickManager();//コンストラクタ
	~CGimmickManager() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	void Regist(CGimmick* pGimmick);//登録処理
	void Load() override;//読込処理
	void Collision(CGimmick::CollisionParam& aParam, CGimmick::TYPE type);//当たり判定
	CGimmick* GetTop() { return m_pTop; }//先頭オブジェクト情報を取得
	CGimmick* Find(CGimmick::TYPE type);//検索処理

private:
	//======================================
	// 変数
	//======================================
	CGimmick* m_pTop;//先頭オブジェクトのポインタ
	CGimmick* m_pCur;//終端オブジェクトのポインタ
};

#endif
