//==============================================================================================================================================
//
// ミニゲーム失敗演出に関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _MINIGAMEFAILED_H_ //このマクロ定義がされなかったら
#define _MINIGAMEFAILED_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "billboardeffect.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CMiniGameFailed : public CBillboardEffect
{
public:
	//======================================
	// 関数
	//======================================
	CMiniGameFailed(int nPriority = static_cast<int>(Category::EFFECT));//コンストラクタ
	~CMiniGameFailed() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CMiniGameFailed* Create(const D3DXVECTOR3& pos, CObject3D* pObj);//生成処理

private:
	//======================================
	// 関数
	//======================================
	void OffSetPos();//座標調節
	void DecDisPlayTime();//表示時間減少

	//======================================
	// 定数
	//======================================
	static inline const D3DXVECTOR3 SIZE = { 120.0f, 50.0f, 0.0f };//生成サイズ
	const int DISPLAY_TIME = 3;//表示時間(秒数)

	//======================================
	// 変数
	//======================================
	CObject3D* m_pTargetObj;//対象オブジェクト
	D3DXVECTOR3 m_DiffDistance;//対象オブジェクトとの距離
	int m_nDisPlayTime;//表示時間
};

#endif