//==============================================================================================================================================
//
// ノーマルパーティクルに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _NORMALPARTICLE_H_ //このマクロ定義がされなかったら
#define _NORMALPARTICLE_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "particle.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CNormalParticle : public CParticle
{
public:
	//======================================
	// 関数
	//======================================
	CNormalParticle();//コンストラクタ
	~CNormalParticle() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	void SetMoveValue() override;//移動量設定処理

private:
	//======================================
	// 定数
	//======================================
	const int MAX_SPEED = 20;//最大速度
	const float SPEED = 5.0f;//速度倍率
};

#endif