//==============================================================================================================================================
//
// パーティクルに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _PARTICLE_H_ //このマクロ定義がされなかったら
#define _PARTICLE_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "billboardeffect.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CParticle : public CBillboardEffect
{
public:
	//======================================
	// 列挙型定義
	//======================================
	enum class TYPE
	{
		NONE = 0,
		NORMAL,//ノーマル
		ASCEND,//上昇
		MAX
	};

	//======================================
	// 関数
	//======================================
	CParticle(int nPriority = static_cast<int>(Category::EFFECT));//コンストラクタ
	~CParticle() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	virtual void SetMoveValue() {}//移動量設定
	static CParticle* Create(TYPE type, const D3DXVECTOR3& pos, const D3DXVECTOR3& size, int nLife, const D3DXCOLOR& col);//生成処理

private:
	//======================================
	// 変数
	//======================================
	D3DXVECTOR3 m_MaxSize;//最大サイズ
	TYPE m_type;//タイプ
	int m_nMaxLife;//寿命最大値
	int m_nLife;//寿命
};

#endif