//==============================================================================================================================================
//
// ステージ回転ゾーンに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _ROTATIONZONE_H_ //このマクロ定義がされなかったら
#define _ROTATIONZONE_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "gimmick.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CRotationZone : public CGimmick
{
public:
	//======================================
	// 関数
	//======================================
	CRotationZone();//コンストラクタ
	~CRotationZone() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	bool Collision(CollisionParam& aParam) override;//当たり判定

private:
	//======================================
	// 関数
	//======================================
	void CameraRotation(CollisionParam& aParam);//カメラ回転処理
};

#endif
