//==============================================================================================================================================
//
// 看板オブジェクト管理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _SIGNBOARDMANAGER_H_ //このマクロ定義がされなかったら
#define _SIGNBOARDMANAGER_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "objectmanager.h"
#include "signboard.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CSignBoardManager : public CObjectManager
{
public:
	//======================================
	// 関数
	//======================================
	CSignBoardManager();//コンストラクタ
	~CSignBoardManager() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	void Regist(CSignBoard* pSignBoard);//登録処理
	void Load() override;//読込処理
	CSignBoard* Find(CSignBoard::TYPE type);//検索処理

private:
	//======================================
	// 変数
	//======================================
	CSignBoard* m_pTop;//先頭オブジェクトのポインタ
	CSignBoard* m_pCur;//終端オブジェクトのポインタ
};

#endif
