//==============================================================================================================================================
//
// 煙に関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _SMOKE_H_ //このマクロ定義がされなかったら
#define _SMOKE_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "billboardeffect.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CSmoke : public CBillboardEffect
{
public:
	//======================================
	// 関数
	//======================================
	CSmoke(int nPriority = static_cast<int>(Category::EFFECT));//コンストラクタ
	~CSmoke() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CSmoke* Create(const D3DXVECTOR3& pos, const D3DXVECTOR3& size, int nLife);//生成処理


private:
	//======================================
	// 定数
	//======================================
	const float SPEED = 2.0f;//速度
	D3DXVECTOR3 m_MaxSize;//最大サイズ
	int m_nMaxLife;//寿命最大値
	int m_nLife;//寿命
};

#endif