//==============================================================================================================================================
//
// Xファイル・テクスチャタグの処理
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "tag.h"

//===========================================================================================================
// コンストラクタ
//===========================================================================================================
CTag::CTag()
{
}

//===========================================================================================================
// デストラクタ
//===========================================================================================================
CTag::~CTag()
{
}

//===========================================================================================================
// タグ設定処理
//===========================================================================================================
void CTag::SetTag(TAG& tag, std::string str)
{
	//PLAYERが見つかった場合
	if (str.compare("PLAYER") == 0)
	{
		//タグをPLAYERに設定
		tag = TAG::PLAYER;
	}
	//BLOCKが見つかった場合
	else if (str.compare("BLOCK") == 0)
	{
		//タグをBLOCKに設定
		tag = TAG::BLOCK;
	}
	//GIMMICKが見つかった場合
	else if (str.compare("GIMMICK") == 0)
	{
		//タグをGIMMICKに設定
		tag = TAG::GIMMICK;
	}
	//BULLETが見つかった場合
	else if (str.compare("BULLET") == 0)
	{
		//タグをBULLETに設定
		tag = TAG::BULLET;
	}
	//ENEMYが見つかった場合
	else if (str.compare("ENEMY") == 0)
	{
		//タグをENEMYに設定
		tag = TAG::ENEMY;
	}
	//BACK_3Dが見つかった場合
	else if (str.compare("BACK_3D") == 0)
	{
		//タグをBACK_3Dに設定
		tag = TAG::BACK_3D;
	}
	//BOSSが見つかった場合
	else if (str.compare("BOSS") == 0)
	{
		//タグをBOSSに設定
		tag = TAG::BOSS;
	}
	//AREAが見つかった場合
	else if (str.compare("AREA") == 0)
	{
		//タグをAREAに設定
		tag = TAG::AREA;
	}
	//BGが見つかった場合
	else if (str.compare("BG") == 0)
	{
		//タグをBGに設定
		tag = TAG::BG;
	}
	//EFFECTが見つかった場合
	else if (str.compare("EFFECT") == 0)
	{
		//タグをEFFECTに設定
		tag = TAG::EFFECT;
	}
	//BOSS_ATTACKが見つかった場合
	else if (str.compare("BOSS_ATTACK") == 0)
	{
		//タグをEFFECTに設定
		tag = TAG::BOSS_ATTACK;
	}
	//UIが見つかった場合
	else if (str.compare("UI") == 0)
	{
		//タグをUIに設定
		tag = TAG::UI;
	}
	//SIGN_BOARDが見つかった場合
	else if (str.compare("SIGN_BOARD") == 0)
	{
		//タグをSIGN_BOARDに設定
		tag = TAG::SIGN_BOARD;
	}
	//EFFECT_2Dが見つかった場合
	else if (str.compare("EFFECT_2D") == 0)
	{
		//タグをEFFECT_2Dに設定
		tag = TAG::EFFECT_2D;
	}
}
