//==============================================================================================================================================
//
// ターゲットに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _TARGET_H_ //このマクロ定義がされなかったら
#define _TARGET_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "billboardeffect.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CTarget : public CBillboardEffect
{
public:
	//======================================
	// 関数
	//======================================
	CTarget(int nPriority = static_cast<int>(Category::EFFECT));//コンストラクタ
	~CTarget() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	static CTarget* Create(const D3DXVECTOR3& pos, CObject3D* pObj);//生成処理

private:
	//======================================
	// 関数
	//======================================
	void CalculationRange();//対象オブジェクトとの距離計算処理

	//======================================
	// 定数
	//======================================
	static inline const D3DXVECTOR3 SIZE = { 100.0f, 100.0f, 0.0f };
	const float ROTATION_SPEED = 0.02f;//回転速度
	const float DELETE_DISTANCE = 10.0f;//ターゲット削除の対象オブジェクトとの距離範囲

	//======================================
	// 変数
	//======================================
	CObject3D* m_pTargetObj;//対象オブジェクト
};

#endif