//==============================================================================================================================================
//
// タイマーの見出しに関する処理
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "timerheading.h"

//===========================================================================================================
// コンストラクタ
//===========================================================================================================
CTimeHeading::CTimeHeading() : CUI()
{
}

//===========================================================================================================
// デストラクタ
//===========================================================================================================
CTimeHeading::~CTimeHeading()
{
}

//===========================================================================================================
// 初期化処理
//===========================================================================================================
HRESULT CTimeHeading::Init()
{
	//エディット可能フラグ
	SetEditFlag(false);

	//基底クラス初期化処理
	if (FAILED(CUI::Init()))
	{
		return E_FAIL;
	}

	return S_OK;
}

//===========================================================================================================
// 終了処理
//===========================================================================================================
void CTimeHeading::Uninit()
{
	//基底クラス終了処理
	CUI::Uninit();
}

//===========================================================================================================
// 更新処理
//===========================================================================================================
#include "timenumber.h"
void CTimeHeading::Update()
{
	//エディタ中
	if (CManager::GetInstance()->GetScene()->GetSceneState() != CScene::SCENE::GAME) return;

	//全タイマーナンバーのX座標合計値
	float fAllTimeNumber_pos_x = 0.0f;

	//UIカテゴリーの先頭オブジェクト取得
	CObject* pObj = CObject::GetTop(static_cast<int>(Category::UI));

	//オブジェクト情報がnullptrになるまで繰り返す
	while (pObj != nullptr)
	{
		//次のオブジェクト情報を取得
		CObject* pNext = pObj->GetNext();

		//オブジェクト情報が存在する
		if (pObj != nullptr)
		{
			//UIクラスにダウンキャスト
			CUI* pUI = CObject::DownCast<CUI, CObject>(pObj);

			//UIのタイプがタイマーナンバーではない場合
			if (pUI->GetUIType() == CUI::TYPE::TIME_NUMBER)
			{
				//タイマーナンバーのX座標を加算
				fAllTimeNumber_pos_x += pUI->GetPos().x;
			}
		}

		//オブジェクト情報を次の情報に変更する
		pObj = pNext;
	}

	//自分自身の座標を取得
	D3DXVECTOR2 pos = GetPos();

	//全タイマーナンバーのX座標の平均値を設定
	pos.x = fAllTimeNumber_pos_x / static_cast<float>(CTimeNumber::GetDigit());

	//座標設定
	SetPos(pos);

	//基底クラス更新処理
	CUI::Update();
}

//===========================================================================================================
// 描画処理
//===========================================================================================================
void CTimeHeading::Draw()
{
	//基底クラス描画処理
	CUI::Draw();
}
