//==============================================================================================================================================
//
// タイトル画面に関する処理
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "title.h"
#include "UI.h"
#include "blockmanager.h"
#include "enemymanager.h"
#include "back_3D.h"
#include "fade.h"
#include "camera.h"

//===========================================================================================================
// コンストラクタ
//===========================================================================================================
CTitle::CTitle() : CScene()
{
}

//===========================================================================================================
// デストラクタ
//===========================================================================================================
CTitle::~CTitle()
{
}

//===========================================================================================================
// 初期化処理
//===========================================================================================================
HRESULT CTitle::Init()
{
	//ブロックマネージャーのインスタンス取得
	CBlockManager* pBlockManager = NEW CBlockManager();
	SetBlockManager(pBlockManager);//インスタンス設定

	//ブロックマネージャー初期化処理
	if (FAILED(pBlockManager->Init()))
	{
		return E_FAIL;
	}

	//エネミーマネージャーのインスタンス取得
	CEnemyManager* pEnemyManager = NEW CEnemyManager();
	SetEnemyManager(pEnemyManager);//インスタンス設定

	//エネミーマネージャー初期化処理
	if (FAILED(pEnemyManager->Init()))
	{
		return E_FAIL;
	}

	//シーン初期化処理
	if (FAILED(CScene::Init()))
	{
		return E_FAIL;
	}

	//ステージ背景生成
	CBack3D::Create({ 0.0f, 0.0f, 0.0f }, { 0.0f, 0.0f, 0.0f }, { 0.0f, 0.0f, 0.0f }, CBack3D::TYPE::SKY);

	//BGM再生
	CManager::GetInstance()->GetSound()->Play(CSound::SOUND::BGM_TITLE);

	return S_OK;
}

//===========================================================================================================
// 終了処理
//===========================================================================================================
void CTitle::Uninit()
{
	//BGM再生終了
	CManager::GetInstance()->GetSound()->Stop(CSound::SOUND::BGM_TITLE);

	//基底クラス終了処理
	CScene::Uninit();
}

//===========================================================================================================
// 更新処理
//===========================================================================================================
void CTitle::Update()
{
	//マネージャーのインスタンス取得
	CManager* pManager = CManager::GetInstance();

	//Enterキー、Aボタン、Startボタンが押された場合
	if (pManager->GetKeyboard()->GetTrigger(DIK_RETURN) || 
		pManager->GetJoypad()->GetTrigger(CInputJoypad::JOYKEY::JOYKEY_A) || 
		pManager->GetJoypad()->GetTrigger(CInputJoypad::JOYKEY::JOYKEY_START))
	{
		//SE再生
		pManager->GetSound()->Play(CSound::SOUND::SELECT);

		//チュートリアル画面へ移行
		pManager->GetFade()->SetFade(MODE::MODE_TUTORIAL);
	}

	//カメラの更新処理
	pManager->GetCamera()->Update();

	//基底クラス更新
	CScene::Update();
}

//===========================================================================================================
// 描画処理
//===========================================================================================================
void CTitle::Draw()
{
	//カメラの設定
	CManager::GetInstance()->GetCamera()->SetCamera();
}

//===========================================================================================================
// 生成処理
//===========================================================================================================
CTitle* CTitle::Create()
{
	//メモリを動的確保
	CTitle* pTitle = NEW CTitle();

	return pTitle;
}
